//****************************************
// 主程序
//****************************************
#include "reg51.h"
#include "send.h"
#include "mpu6050.h"
#include "heart.h"
#include "oled.h"

//*******************************************************************************************************
//主程序
//*******************************************************************************************************
void main()
{ 
	//初始化串口
	uInit();
	// 初始化串口2
	u2Init();
	delay(150);
//	// 初始化MPU6050
	InitMPU6050();
	//OLED 屏幕初始化
	oledInit();
//	delay(150);
	while(1)
	{
		//oledInit();
		//获取心率传感器的数据
		Startheart();
		//获取xyz传感器的数据
		startGetPosition();
		//SendString("1:hello,word\r\n");
		//SendString2("2:hello,word\r\n");
		delay(5000);
	}
}

